{
  "hi_im": "Hi, Thayná here!",
  "frontend_developer": "A frontend developer",
  "designer": "A UX/UI designer",
  "about": "About",
  "timeline":"Timeline",
  "see_studycase": "See case study",
  "introduction": "— Hi there! I’m a Frontend Developer with +5 years of experience crafting interfaces that tell stories and deliver out-of-this-world experiences.<br/><br/>Recently, I dove into the world of UX/UI and rediscovered my fascination with creating designs that break the mold and challenge the ordinary.<br/><br/>I love traveling the world, observing what goes unnoticed, plunging into the unknown, understanding how people feel, and transforming all of that into meaningful and surprising experiences. This attentive perspective has been my greatest growth throughout my journey — today it drives me to create with empathy, purpose, and a touch of boldness.<br/><br/>Here in my portfolio, you'll find projects that combine research, user-centered design, and interfaces crafted to truly engage.",
  "see_more": "See more",
  "frontend_projects": "Discover the projects I've developed, highlighting my experience in frontend development. See how I build responsive, efficient and visually appealing web applications using modern technologies and best market practices.",
  "uxui_projects": "Here are some of the projects I've worked on, showcasing my skills in UX/UI design. Explore how I create intuitive, responsive and visually engaging user experiences.",
  "say_hi": "Get in touch",
  "frontend": "Frontend Projects",
  "uxui": "UX/UI Projects",
  "made_by_me": "© 2025 Thayná Müller. All rights reserved.",
  "my_projects": "My projects",
  "skills_and_tools": "Skills & Tools",
  "contact": "Contact",
  "contact_title": "Talk",
  "me": "me",
  "to_me": "to me",
  "about_me": "About me",
  "contact_description": "Feel free to reach out for project collaborations or questions. <strong>Let's build something amazing together!</strong>",
  "project_introduction": "Here are some of my frontend and UX/UI projects, focused on responsive designs and intuitive interfaces. Each project reflects my growth and dedication to creating practical and visually appealing solutions.",
  "this_portfolio": "This Portfolio",
  "this_portfolio_description": "I created this personal portfolio to showcase my skills as a Frontend Developer and UX/UI designer. My main goal was to build a clean, modern and easy-to-navigate site that reflects who I am as a professional and highlights my passion for impactful design and intuitive user experiences.",
  "nearby": "The project is a mobile benefit club app with coupons to use at establishments near you.<br/> Developed to make accessing exclusive local perks easier, the app combines convenience, savings and a fast experience with efficient APIs.",
  "nearby_intro": "Benefit club with QR Code to redeem coupons, interactive map to find partners and Node.js API integration.",
  "itau_title": " Itaú - Digital ecosystem",
  "itau_description": "Development of an integrated digital ecosystem, covering channels such as mobile app, desktop, smartwatch and ATMs. The project included the creation of wireframes, usability flows and financial charts optimized for both mobile and desktop. The goal was to enhance user experience, focusing on financial organization, accessibility and consistency with Itaú's visual identity.",
  "tecnologies_utilized": "Technologies used:",
  "contact_error_message": "Oops, something went wrong. Try again later or reach me on social media.",
  "contact_success_message": "Message sent successfully! I’ll get back to you shortly.",
  "name": "Name",
  "email": "Email",
  "message": "Message",
  "send_message": "Send",
  "sending": "Sending...",
  "back": "Back",
  "finny_description": "Finny – Cashback Goals is a financial app designed to turn small purchases into personal goals.<br/> The project went through all stages of a complete UX/UI process: desk research, benchmarking, qualitative research with real users, persona definitions, journey mapping, wireframes and finally a high-fidelity prototype that visually and functionally represents it all.",
  "my": "My",
  "projects": "Projects",
  "ct": "ct",
  "portfolio_description": "This portfolio was created to express my profile as a frontend developer and UX/UI enthusiast. <br/> Built with Next.js, TypeScript and Tailwind CSS, it prioritizes performance, SEO and a modern look.<br/> Micro-animations and small details reinforce interactivity and my passion for design. The idea is to merge aesthetics and functionality, highlighting how I think and build digital experiences.",
  "portfolio_intro": "Focused on performance, responsiveness and a modern UI that translates my passion for well-crafted digital experiences.",
  "itau_intro": "UX/UI to unify App, Desktop, Smartwatch and ATM, creating a fluid experience and strengthening Itaú’s identity across all channels.",
  "finny_intro": "A financial app designed to turn cashback into real goals and achievements, combining gamification, planning and rewards.",
  "i_develop":"I develop",
  "skills": "interfaces that combine <strong>design, performance, and accessibility</strong>, always focused on creating <strong>intuitive and engaging user experiences</strong>.<br/><br/>",
  "skills2": "My stack includes <strong>React</strong>, <strong>Next.js</strong>, <strong>React Native</strong>, and <strong>TypeScript</strong>, using <strong>Vite</strong> for high-speed development, <strong>Tailwind CSS</strong> and <strong>Sass (SCSS)</strong> for efficient styling, and <strong>Framer Motion</strong> for smooth animations",
  "skills3": "I have experience working with <strong>design systems</strong> such as <strong>Material UI</strong> and <strong>Ant Design</strong>, ensuring consistency and scalability across interfaces.<br/>I also apply <strong>React Testing Library</strong> for unit testing to ensure quality and reliability in the codebase.",
  "skills4": "Every project I build is guided by a vision that balances <strong>aesthetics, usability, and accessibility</strong>, striving to deliver products that are <strong>beautiful, functional, and inclusive</strong>.",
  "project_description": "<strong>A bit of what I've been creating:</strong> projects that combine UX/UI, research and frontend, always seeking experiences that are beautiful, functional and full of purpose.<br/><br/> Each one tells part of my journey and the lessons I've gathered along the way.",
  "tech_skills": "<i>“</i>With <strong>React, Next.js, Javascript and TypeScript</strong>, I build the structure and intelligence that bring a project to life.<i>”</i>",
  "design_skills": "<i>“</i><strong>Tailwind and SCSS</strong> are my brushes to add color, shape and personality, creating interfaces that not only work but also enchant.<i>”</i>",
  "figma_skills": "<i>“</i>In <strong>Figma</strong>, I experiment, research and think through each interaction so everything makes sense for the user.<i>”</i>",
  "see_more_in": "See more in",
  "get_in_touch": "Get in touch",
  "hello": "Hey there! I'm Thayná.",
  "present": "A Frontend Developer",
  "present_2": " and UX/UI Designer based in Brazil.",
  "everywhere": "everywhere.",
  "frontend_developer_text": "FRONT-END DEVELOPER",
  "hint": "Hover over the cards",
  "remedia_intro": "Remedia is a health app that helps patients and caregivers manage treatments in a simple and supportive way. With smart reminders and an accessible interface, it builds confidence and promotes well-being in daily life.",
  "remedia_description": "Remedia was designed for people with special needs who must take their medication on time. The app features a distraction-free, highly accessible UI, and provides caregiver access to track adherence and support the patient. Built with React Native and Expo, the project was planned to prioritize inclusivity, simplicity, and reliability in daily use.",
  "Transitioned from Civil Engineering into technology after completing a web development bootcamp. Worked as a Full Stack Developer, building production systems with modern JavaScript frameworks and RESTful APIs using Java and Spring Boot.":"Transitioned from Civil Engineering into technology after completing a web development bootcamp. Worked as a Full Stack Developer, building production systems with modern JavaScript frameworks and RESTful APIs using Java and Spring Boot.",
  "I joined SPOT Metrics as a Frontend Developer, where I started building scalable and data-driven interfaces using React, TypeScript, and modern front-end practices. I specialized in frontend development, the area I most connected with, beginning a journey focused on creating intuitive experiences supported by solid technical implementation.":"I joined SPOT Metrics as a Frontend Developer, where I started building scalable and data-driven interfaces using React, TypeScript, and modern front-end practices. I specialized in frontend development, the area I most connected with, beginning a journey focused on creating intuitive experiences supported by solid technical implementation.",
  "Promoted to Mid-Level Frontend Developer, I took on greater responsibility in complex projects, working closely with designers and backend engineers to deliver high-performance, user-focused interfaces.":"Promoted to Mid-Level Frontend Developer, I took on greater responsibility in complex projects, working closely with designers and backend engineers to deliver high-performance, user-focused interfaces.",
  "Alongside my role at SPOT Metrics, I started working as a freelance Frontend Developer through an e-commerce agency, building and maintaining online experiences for nationally recognized brands such as Democrata, Bagaggio, and Tecnos. Most of these projects were developed with JavaScript (Vanilla) and the VTEX platform, giving me solid experience in web performance, conversion optimization, and client communication. During this time, I also began my degree in Systems Analysis and Development.":"Alongside my role at SPOT Metrics, I started working as a freelance Frontend Developer through an e-commerce agency, building and maintaining online experiences for nationally recognized brands such as Democrata, Bagaggio, and Tecnos. Most of these projects were developed with JavaScript (Vanilla) and the VTEX platform, giving me solid experience in web performance, conversion optimization, and client communication. During this time, I also began my degree in Systems Analysis and Development.",
  "I completed a professional course in UX/UI Design at EBAC (British School of Creative Arts), where I developed solid skills in user research, wireframing, prototyping, and usability testing. I began applying these concepts directly at SPOT Metrics, combining design thinking with my technical expertise to improve user experience and product usability.":"I completed a professional course in UX/UI Design at EBAC (British School of Creative Arts), where I developed solid skills in user research, wireframing, prototyping, and usability testing. I began applying these concepts directly at SPOT Metrics, combining design thinking with my technical expertise to improve user experience and product usability.",
  "Promoted to a hybrid role as Frontend Developer & UX Designer at SPOT Metrics, I combine design strategy with technical implementation to deliver data-driven, user-centered experiences. I lead usability testing, design prototypes, and implement accessible, scalable front-end solutions. In parallel, now , I work as freelance on UX/UI projects, expanding my expertise in user research, prototyping, and creative direction.":"Promoted to a hybrid role as Frontend Developer & UX Designer at SPOT Metrics, I combine design strategy with technical implementation to deliver data-driven, user-centered experiences. I lead usability testing, design prototypes, and implement accessible, scalable front-end solutions. In parallel, now , I work as freelance on UX/UI projects, expanding my expertise in user research, prototyping, and creative direction.",
  "timeline_title":"Travel Through My Journey as a Frontend Developer & UX/UI Designer"
  
  
}
