{
  "hi_im": "Olá , Thayná aqui!",
  "frontend_developer": "Uma Desenvolvedora frontend",
  "designer": "Uma UX/UI designer",
  "about": "Sobre",
  "introduction": {
    "greeting": "Olá! Eu sou Thayná Müller, UX/UI designer e desenvolvedora frontend.",
    "hobbies": "Sou movida por curiosidade: adoro viajar, descobrir novos lugares e me perder em outras culturas. Tudo isso vai direto para o meu repertório criativo — porque acredito que boas ideias nascem do olhar atento e de referências vividas.",
    "welcome": "Aqui no meu portfólio você vai encontrar projetos que unem pesquisa, design centrado no usuário e interfaces feitas para encantar e engajar.",
    "finish": " Dá uma olhada no que já criei... quem sabe a próxima grande ideia a gente não constrói juntos?"
  },
  "see_more": "Veja mais",
  "frontend_projects": "Descubra os projetos que desenvolvi, destacando minha experiência em desenvolvimento frontend. Veja como construo aplicações web responsivas, eficientes e visualmente atraentes, utilizando tecnologias modernas e as melhores práticas do mercado.",
  "uxui_projects": "Aqui estão alguns dos projetos nos quais trabalhei, mostrando minhas habilidades em UX/UI design. Explore como crio experiências de usuário intuitivas, responsivas e visualmente atraentes.",
  "say_hi": "Dar um Oi!",
  "frontend": "Projetos frontend",
  "uxui": "Projetos UX/UI",
  "made_by_me": "Feito por mim com",
  "my_projects": "Meus projetos",
  "skills_and_tools": "Skills & Ferramentas",
  "contact": "Contato",
  "contact_title": "Fale",
  "me": "Comigo",
  "contact_description": "Sinta-se à vontade para me contatar para colaborações em projetos ou dúvidas. Vamos construir algo incrível juntos!",
  "project_introduction": "Aqui estão alguns dos meus projetos de frontend e UX/UI, com foco em designs responsivos e interfaces intuitivas. Cada projeto reflete meu crescimento e dedicação em criar soluções práticas e visualmente atraentes.",
  "ct": "to",
  "drag_to_see_more": "Arraste para ver mais",
  "waves": "Um reprodutor de música elegante construído com Next.js e SASS, com integração perfeita com a API do Jamendo para transmitir músicas gratuitas sem esforço.",
  "landing_page_title": "Landing page e E-mail marketing - SumUP/Pix",
  "landing_page_description": "Uma página de destino e uma campanha de e-mail marketing com visuais e textos personalizados para o público-alvo, explicando os benefícios e a funcionalidade do Pix. A landing page destaca as principais vantagens, como ausência de taxas, disponibilidade 24/7 e processamento instantâneo de pagamentos. Os e-mails apresentam mensagens claras e concisas, simplificando o processo de adesão e oferecendo dicas práticas para a integração do Pix nos negócios.",
  "this_portfolio": "Este Portifólio",
  "this_portfolio_description": "Criei este portfólio pessoal para apresentar minhas habilidades como Desenvolvedor Frontend e UX/UI design. Meu principal objetivo foi criar um site limpo, moderno e fácil de navegar, que reflita quem eu sou como profissional e destaque minha paixão por design impactante e experiências de usuário intuitivas.",
  "nearby": "Um aplicativo móvel altamente funcional: um clube de benefícios com escaneamento de QR Code via câmera, um mapa interativo para localizar estabelecimentos próximos e integração com APIs em Node.js.",
  "itau_title": " Itaú - Ecossistema digital",
  "itau_description": "Desenvolvimento de um ecossistema digital integrado, abrangendo canais como aplicativo móvel, desktop, smartwatch e caixas eletrônicos. O projeto incluiu a criação de wireframes, fluxos de usabilidade e gráficos financeiros otimizados tanto para dispositivos móveis quanto para desktop. O objetivo foi aprimorar a experiência do usuário, com foco na organização financeira, acessibilidade e consistência com a identidade visual do Itaú.",
  "tecnologies_utilized": "Tecnologias utilizadas:",
  "contact_error_message": "Putz , algo deu errado. Tente mais tarde ou me contate por alguma rede social.",
  "contact_success_message": "Mensagem enviada com sucesso! Já te respondo.",
  "name": "Nome",
  "email": "E-mail",
  "message": "Mensagem",
  "send_message": "Enviar",
  "sending": "Enviando...",
  "back": "Voltar"
}
