{
  "hi_im": "Olá , Thayná aqui!",
  "front_end_dev":"Frontend &",
  "ux_ui_designer":"UX/UI Designer",
  "about": "Sobre",
  "timeline":"Timeline",
  "see_studycase": "Ver estudo de caso",
  "introduction": "Sou Frontend Developer há mais de 5 anos e encontrei no UX/UI uma forma de unir tudo o que mais gosto: criar, observar e transformar ideias em experiências que realmente fazem sentido para as pessoas. Quanto mais me aprofundei no design, mais percebi o quanto entender emoções, comportamentos e pequenos detalhes faz diferença no resultado final.<br/><br/>Gosto de explorar o mundo, reparar no que passa despercebido e levar essa sensibilidade para o que construo. Isso me ajuda a criar interfaces que não são só bonitas — mas claras, funcionais e com propósito.",
  "see_more": "Veja mais",
  "frontend_projects": "Descubra os projetos que desenvolvi, destacando minha experiência em desenvolvimento frontend. Veja como construo aplicações web responsivas, eficientes e visualmente atraentes, utilizando tecnologias modernas e as melhores práticas do mercado.",
  "uxui_projects": "Aqui estão alguns dos projetos nos quais trabalhei, mostrando minhas habilidades em UX/UI design. Explore como crio experiências de usuário intuitivas, responsivas e visualmente atraentes.",
  "say_hi": "Entrar em contato",
  "frontend": "Projetos frontend",
  "uxui": "Projetos UX/UI",
  "made_by_me": "© 2025 Thayná Müller. Todos os direitos reservados.",
  "my_projects": "Meus projetos",
  "skills_and_tools": "Skills & Ferramentas",
  "contact": "Contato",
  "contact_title": "Fale",
  "me": "mim",
  "to_me": "comigo",
  "about_me": "Sobre mim",
  "contact_description": "Sinta-se à vontade para me contatar para colaborações em projetos ou dúvidas. <strong>Bora construir algo incrível juntos!</strong>",
  "project_introduction": "Aqui estão alguns dos meus projetos de frontend e UX/UI, com foco em designs responsivos e interfaces intuitivas. Cada projeto reflete meu crescimento e dedicação em criar soluções práticas e visualmente atraentes.",
  "this_portfolio": "Este Portifólio",
  "this_portfolio_description": "Criei este portfólio pessoal para apresentar minhas habilidades como Desenvolvedor Frontend e UX/UI design. Meu principal objetivo foi criar um site limpo, moderno e fácil de navegar, que reflita quem eu sou como profissional e destaque minha paixão por design impactante e experiências de usuário intuitivas.",
  "nearby": "O projeto é um aplicativo mobile de clube de benefícios com cupons para utilizar em estabelecimentos próximos a você.<br/> Desenvolvido para facilitar o acesso a vantagens exclusivas em locais próximos, o app une praticidade, economia e uma experiência rápida com APIs eficientes.",
  "nearby_intro": "Clube de benefícios com QR Code para resgatar cupons, mapa interativo para achar parceiros e integração com APIs Node.js.",
  "itau_title": " Itaú - Ecossistema digital",
  "itau_description": "Desenvolvimento de um ecossistema digital integrado, abrangendo canais como aplicativo móvel, desktop, smartwatch e caixas eletrônicos. O projeto incluiu a criação de wireframes, fluxos de usabilidade e gráficos financeiros otimizados tanto para dispositivos móveis quanto para desktop. O objetivo foi aprimorar a experiência do usuário, com foco na organização financeira, acessibilidade e consistência com a identidade visual do Itaú.",
  "tecnologies_utilized": "Tecnologias utilizadas:",
  "contact_error_message": "Putz , algo deu errado. Tente mais tarde ou me contate por alguma rede social.",
  "contact_success_message": "Mensagem enviada com sucesso! Já te respondo.",
  "name": "Nome",
  "email": "E-mail",
  "message": "Mensagem",
  "send_message": "Enviar",
  "sending": "Enviando...",
  "back": "Voltar",
  "finny_description": "Finny – Cashback Goals, é um app financeiro pensado pra transformar pequenas compras em metas pessoais.<br/> O projeto passou por todas as etapas de um processo completo de UX/UI: fiz desk research, benchmarking, pesquisa qualitativa com usuários reais, definição de personas, mapeamento de jornadas, criação de wireframes e, por fim, um protótipo de alta fidelidade que representa tudo isso de forma visual e funcional.",
  "my": "Meus",
  "projects": "Projetos",
  "ct": "to",
  "portfolio_description": "Este portfólio foi criado para traduzir meu perfil como desenvolvedora frontend e entusiasta de UX/UI.<br/> Feito com Next.js, TypeScript e Tailwind CSS, prioriza performance, SEO e um visual moderno.<br/> Microanimações e pequenos detalhes reforçam a interatividade e minha paixão por design. A ideia é unir estética e funcionalidade, destacando como penso e construo experiências digitais.",
  "portfolio_intro": "Focado em performance, responsividade e uma UI moderna que traduz minha paixão por experiências digitais bem construídas.",
  "itau_intro": "UX/UI para unificar App, Desktop, Smartwatch e ATM, criando uma experiência fluida e reforçando a identidade do Itaú em todos os canais.",
  "finny_intro": "Um app financeiro pensado para transformar cashback em metas e conquistas reais, unindo gamificação, planejamento e recompensas.",
  "i_develop":"Eu desenvolvo",
  "skills": "interfaces que unem <strong>design, performance e acessibilidade</strong>, sempre com foco em <strong>experiências intuitivas e envolventes</strong>.<br/><br/>",
  "skills2": "Trabalho com <strong>React</strong>, <strong>Next.js</strong>, <strong>React Native</strong> e <strong>TypeScript</strong>, utilizando <strong>Vite</strong> para performance, <strong>Tailwind CSS</strong> e <strong>Sass (SCSS)</strong> para estilização eficiente, e <strong>Framer Motion</strong> para animações fluidas.",  
  "project_description": "<strong>Um pouco do que venho criando por aí:</strong> projetos que unem UX/UI, pesquisa e frontend, sempre buscando experiências bonitas, funcionais e cheias de propósito.<br/><br/> Cada um conta um pedaço da minha trajetória e dos aprendizados que fui colecionando pelo caminho",
  "tech_skills": "<i>“</i>Com <strong>React, Next.js, Javascript e TypeScript</strong>, construo a estrutura e a inteligência que fazem um projeto ganhar vida.<i>”</i>",
  "design_skills": "<i>“</i><strong>Tailwind e SCSS</strong> são meus pincéis para adicionar cor, forma e personalidade, criando interfaces que não apenas funcionam, mas também encantam.<i>”</i>",
  "figma_skills": "<i>“</i>No <strong>Figma</strong>, experimento, pesquiso e penso em cada interação para que tudo faça sentido para o usuário.<i>”</i>",
  "see_more_in": "Veja mais em",
  "get_in_touch": "Fale comigo",
  "hello": "Olá! Thayná aqui.",
  "present": " Sou Desenvolvedora Frontend",
  "present_2": " e UX/UI Designer do Brasil.",
  "everywhere": "de qualquer lugar do mundo.",
  "frontend_developer_text": "DESENVOLVEDORA FRONTEND",
  "hint": "Passe o mouse sobre os cards",
  "remedia_intro": "Remedia é um app de saúde que ajuda pacientes e cuidadores a acompanhar tratamentos de forma simples e acolhedora. Com lembretes inteligentes e interface acessível, garante mais confiança e bem-estar no dia a dia.",
  "remedia_description": "Remedia foi projetado para pessoas com necessidades especiais que devem tomar seus medicamentos pontualmente. O aplicativo possui uma interface altamente acessível e sem distrações, além de fornecer acesso a cuidadores para monitorar a adesão e apoiar o paciente. Construído com React Native e Expo, o projeto foi planejado para priorizar inclusão, simplicidade e confiabilidade no uso diário.",
  "I transitioned from Civil Engineering into tech after a web development bootcamp and soon started working as a Full Stack Developer, building production applications using modern JavaScript frameworks, Java, and Spring Boot.":"I transitioned from Civil Engineering into tech after a web development bootcamp and soon started working as a Full Stack Developer, building production applications using modern JavaScript frameworks, Java, and Spring Boot.",
  "In 2021, I specialized in frontend development, building scalable, data-driven interfaces using React, TypeScript, and modern best practices. During this phase, I strengthened my ability to turn complex requirements into intuitive experiences supported by solid technical foundations.":"Em 2021, me especializei em desenvolvimento frontend, criando interfaces escaláveis e orientadas por dados com React, TypeScript e práticas modernas. Nesse período, aprofundei minha capacidade de transformar requisitos complexos em experiências intuitivas sustentadas por uma base técnica sólida.",
  "Promoted to Mid-Level Frontend Developer, I began leading key parts of complex projects, collaborating closely with designers and backend engineers to deliver high-performance, user-focused interfaces. This phase strengthened my ownership, sharpened my problem-solving skills, and deepened my ability to transform product requirements into scalable, well-crafted solutions.":"Promovida a Desenvolvedora Frontend Pleno, passei a assumir partes-chave de projetos complexos, trabalhando lado a lado com designers e engenheiros backend para entregar interfaces de alta performance e centradas no usuário. Esse período fortaleceu meu senso de ownership, meu raciocínio para resolver problemas e minha habilidade de transformar requisitos de produto em soluções escaláveis e bem estruturadas.",
  "Alongside my main role, I began freelancing as a Frontend Developer through an e-commerce agency, creating and maintaining online experiences for nationally recognized brands such as Democrata, Bagaggio, and Tecnos. Most projects were built using Vanilla JavaScript and the VTEX platform, giving me strong experience in web performance, conversion optimization, and direct client communication. During this period, I also started my degree in Systems Analysis and Development.":"Paralelo ao meu cargo principal, comecei a atuar como freelancer em uma agência de e-commerce, desenvolvendo e mantendo experiências online para marcas nacionais reconhecidas, como Democrata, Bagaggio e Tecnos. A maior parte dos projetos foi criada com JavaScript (Vanilla) e a plataforma VTEX, o que me deu uma base sólida em performance web, otimização de conversão e comunicação direta com clientes. Nesse mesmo período, iniciei minha graduação em Análise e Desenvolvimento de Sistemas.",
  "I completed a professional course in UX/UI Design at EBAC (British School of Creative Arts), where I developed solid skills in user research, wireframing, prototyping, and usability testing. I began applying these concepts directly at my job, combining design thinking with my technical expertise to improve user experience and product usability.":"Realizei um curso profissional de UX/UI Design na EBAC (Escola Britânica de Artes Criativas), onde desenvolvi habilidades sólidas em pesquisa de usuário, wireframing, prototipagem e testes de usabilidade. Passei a aplicar esses conceitos diretamente na empresa em que trabalho, unindo o pensamento de design à minha experiência técnica para aprimorar a experiência do usuário e a usabilidade dos produtos.",
  "Promoted to a hybrid role as Frontend Developer & UX Designer, now I combine design strategy with technical implementation to deliver data-driven, user-centered experiences. I lead usability testing, design prototypes, and implement accessible, scalable front-end solutions. In parallel, now , I also work as freelance on UX/UI projects, expanding my expertise in user research, prototyping, and creative direction.":"Promovida a uma posição híbrida de Desenvolvedora Frontend e UX Designer, agora passei a unir estratégia de design e implementação técnica para entregar experiências orientadas por dados e centradas no usuário. Conduzo testes de usabilidade, desenvolvo protótipos de design e implemento soluções front-end acessíveis e escaláveis. Em paralelo, agora também como UX/UI Designer continuo atuando em projetos freelancers, ampliando minha experiência em pesquisa de usuários, prototipagem e direção criativa.",
  "timeline_title":"Viaje pela minha jornada como Frontend Developer e UX/UI Designer"
}
