{
  "hi_im": "Hi , I'm Thayná Müller!",
  "frontend_developer": "A Frontend developer",
  "designer": "A UX/UI designer",
  "about": "About",
  "introduction": {
    "greeting": "Hello! I'm Thayná Müller, a UX/UI designer and frontend developer from <strong>Brazil</strong>, currently living in the beautiful state of Rio de Janeiro.",
    "hobbies": "When I'm not designing or coding, I love traveling and exploring new cultures, which inspires my <strong>creative</strong> process and broadens my <strong>perspective</strong>.",
    "welcome": "<strong>Welcome</strong> to my portfolio, where you can see some of the projects I've worked on. Let's connect and create something <strong>amazing</strong> together!"
  },
  "see_more": "See more",
  "frontend_projects": "Discover the projects I've developed, highlighting my expertise in frontend development. See how I build responsive, efficient, and visually appealing web applications using modern technologies and industry best practices.",
  "uxui_projects": "Here are some of the projects I've worked on, showcasing my skills in UX/UI design. Explore how I create intuitive, responsive, and visually appealing user experiences.",
  "say_hi": "Let's Chat",
  "frontend": "Frontend projects",
  "uxui": "UX/UI projects",
  "made_by_me": "Made by me with",
  "my_projects": "My projects",
  "contact": "Contact",
  "contact_title": "Contact",
  "me": "me",
  "contact_description": "Feel free to reach out to me for any project collaborations or inquiries. Let's build something amazing together!",
  "project_introduction": "Here are some of my frontend and UX/UI projects, focusing on responsive designs and user-friendly interfaces. Each project reflects my growth and dedication to creating practical and visually  appealing solutions.",
  "ct": "ct",
  "drag_to_see_more": "Drag to see more",
  "waves": "A sleek music player built with Next.js and SASS, featuring seamless integration with the Jamendo API to stream free music effortlessly.",
  "landing_page_title": "Landing page and E-mail marketing - SumUP/Pix",
  "landing_page_description": "A landing page and an email marketing campaign with visuals and text tailored to the target audience to explain the benefits and functionality of Pix. The landing page highlights key advantages, such as no fees, 24/7 availability, and instant payment processing. The emails deliver clear and concise messages, simplifying the onboarding process and offering practical tips for integrating Pix into businesses.",
  "this_portfolio": "This portfolio",
  "this_portfolio_description": "I built this personal portfolio to showcase my skills as a Frontend Developer and UX/UI Designer. My main goal was to create a clean, modern, and easy-to-navigate website that reflects who I am as a professional and highlights my passion for impactful design and intuitive user experiences.",
  "nearby": "A highly functional mobile app: a benefits club with QR Code scanning via camera, an interactive map to locate nearby establishments, and integration with Node.js APIs.",
  "itau_title": " Itaú - Digital Ecosystem",
  "itau_description": "Development of an integrated digital ecosystem covering channels such as mobile app, desktop, smartwatch, and ATMs. The project included the creation of wireframes, usability flows, and financial charts optimized for both mobile and desktop devices. The goal was to enhance user experience with a focus on financial organization, accessibility, and consistency with Itaú's visual identity.",
  "tecnologies_utilized": "Technologies utilized:",
  "contact_error_message": "Uhh , something got wrong. Try later please!",
  "contact_success_message": "Great, it's sent! I'll reply soon.",
  "name": "Name",
  "email": "E-mail",
  "message": "Message",
  "send_message": "Send",
  "sending": "Sending...",
  "back": "Back"
}
